vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/ac.h
/*
 * Component description for AC
 *
 * Copyright (c) 2026 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*      file generated from device description file (ATDF) version None       */
#ifndef _PIC32CMPL10_AC_COMPONENT_H_
#define _PIC32CMPL10_AC_COMPONENT_H_

#if !defined(DISABLE_CMSIS)
#include "core_cm0plus.h"
#endif /* !defined(DISABLE_CMSIS) */

/* ************************************************************************** */
/*                       SOFTWARE API DEFINITION FOR AC                       */
/* ************************************************************************** */

/* -------- AC_COMPCTRLA : (AC Offset: 0x00) (R/W 32) Comparator # Comparator Control A -------- */
#define AC_COMPCTRLA_RESETVALUE               _UINT32_(0x00)                                       /*  (AC_COMPCTRLA) Comparator # Comparator Control A  Reset Value */

#define AC_COMPCTRLA_ENABLE_Pos               _UINT32_(1)                                          /* (AC_COMPCTRLA) Comparator Enable Position */
#define AC_COMPCTRLA_ENABLE_Msk               (_UINT32_(0x1) << AC_COMPCTRLA_ENABLE_Pos)           /* (AC_COMPCTRLA) Comparator Enable Mask */
#define AC_COMPCTRLA_ENABLE(value)            (AC_COMPCTRLA_ENABLE_Msk & (_UINT32_(value) << AC_COMPCTRLA_ENABLE_Pos)) /* Assignment of value for ENABLE in the AC_COMPCTRLA register */
#define AC_COMPCTRLA_OUT_Pos                  _UINT32_(2)                                          /* (AC_COMPCTRLA) Output Enable Position */
#define AC_COMPCTRLA_OUT_Msk                  (_UINT32_(0x1) << AC_COMPCTRLA_OUT_Pos)              /* (AC_COMPCTRLA) Output Enable Mask */
#define AC_COMPCTRLA_OUT(value)               (AC_COMPCTRLA_OUT_Msk & (_UINT32_(value) << AC_COMPCTRLA_OUT_Pos)) /* Assignment of value for OUT in the AC_COMPCTRLA register */
#define AC_COMPCTRLA_HYSTEN_Pos               _UINT32_(3)                                          /* (AC_COMPCTRLA) Hysteresis Enable Position */
#define AC_COMPCTRLA_HYSTEN_Msk               (_UINT32_(0x1) << AC_COMPCTRLA_HYSTEN_Pos)           /* (AC_COMPCTRLA) Hysteresis Enable Mask */
#define AC_COMPCTRLA_HYSTEN(value)            (AC_COMPCTRLA_HYSTEN_Msk & (_UINT32_(value) << AC_COMPCTRLA_HYSTEN_Pos)) /* Assignment of value for HYSTEN in the AC_COMPCTRLA register */
#define AC_COMPCTRLA_INTSEL_Pos               _UINT32_(4)                                          /* (AC_COMPCTRLA) Interrupt Selection Position */
#define AC_COMPCTRLA_INTSEL_Msk               (_UINT32_(0x3) << AC_COMPCTRLA_INTSEL_Pos)           /* (AC_COMPCTRLA) Interrupt Selection Mask */
#define AC_COMPCTRLA_INTSEL(value)            (AC_COMPCTRLA_INTSEL_Msk & (_UINT32_(value) << AC_COMPCTRLA_INTSEL_Pos)) /* Assignment of value for INTSEL in the AC_COMPCTRLA register */
#define   AC_COMPCTRLA_INTSEL_TOGGLE_Val      _UINT32_(0x0)                                        /* (AC_COMPCTRLA) Interrupt on comparator n output toggle  */
#define   AC_COMPCTRLA_INTSEL_RISING_Val      _UINT32_(0x1)                                        /* (AC_COMPCTRLA) Interrupt on comparator n output rising edge  */
#define   AC_COMPCTRLA_INTSEL_FALLING_Val     _UINT32_(0x2)                                        /* (AC_COMPCTRLA) Interrupt on comparator n output falling edge  */
#define AC_COMPCTRLA_INTSEL_TOGGLE            (AC_COMPCTRLA_INTSEL_TOGGLE_Val << AC_COMPCTRLA_INTSEL_Pos) /* (AC_COMPCTRLA) Interrupt on comparator n output toggle Position */
#define AC_COMPCTRLA_INTSEL_RISING            (AC_COMPCTRLA_INTSEL_RISING_Val << AC_COMPCTRLA_INTSEL_Pos) /* (AC_COMPCTRLA) Interrupt on comparator n output rising edge Position */
#define AC_COMPCTRLA_INTSEL_FALLING           (AC_COMPCTRLA_INTSEL_FALLING_Val << AC_COMPCTRLA_INTSEL_Pos) /* (AC_COMPCTRLA) Interrupt on comparator n output falling edge Position */
#define AC_COMPCTRLA_RUNSTDBY_Pos             _UINT32_(6)                                          /* (AC_COMPCTRLA) Run in Standby Position */
#define AC_COMPCTRLA_RUNSTDBY_Msk             (_UINT32_(0x1) << AC_COMPCTRLA_RUNSTDBY_Pos)         /* (AC_COMPCTRLA) Run in Standby Mask */
#define AC_COMPCTRLA_RUNSTDBY(value)          (AC_COMPCTRLA_RUNSTDBY_Msk & (_UINT32_(value) << AC_COMPCTRLA_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the AC_COMPCTRLA register */
#define AC_COMPCTRLA_MUXNEG_Pos               _UINT32_(8)                                          /* (AC_COMPCTRLA) Negative Input Selection Position */
#define AC_COMPCTRLA_MUXNEG_Msk               (_UINT32_(0x7) << AC_COMPCTRLA_MUXNEG_Pos)           /* (AC_COMPCTRLA) Negative Input Selection Mask */
#define AC_COMPCTRLA_MUXNEG(value)            (AC_COMPCTRLA_MUXNEG_Msk & (_UINT32_(value) << AC_COMPCTRLA_MUXNEG_Pos)) /* Assignment of value for MUXNEG in the AC_COMPCTRLA register */
#define   AC_COMPCTRLA_MUXNEG_AINN0_Val       _UINT32_(0x0)                                        /* (AC_COMPCTRLA) Negative pin 0  */
#define   AC_COMPCTRLA_MUXNEG_AINN1_Val       _UINT32_(0x1)                                        /* (AC_COMPCTRLA) Negative pin 1  */
#define   AC_COMPCTRLA_MUXNEG_AINN2_Val       _UINT32_(0x2)                                        /* (AC_COMPCTRLA) Negative pin 2  */
#define   AC_COMPCTRLA_MUXNEG_VREFSCALE_Val   _UINT32_(0x7)                                        /* (AC_COMPCTRLA) Voltage Reference Scaler  */
#define AC_COMPCTRLA_MUXNEG_AINN0             (AC_COMPCTRLA_MUXNEG_AINN0_Val << AC_COMPCTRLA_MUXNEG_Pos) /* (AC_COMPCTRLA) Negative pin 0 Position */
#define AC_COMPCTRLA_MUXNEG_AINN1             (AC_COMPCTRLA_MUXNEG_AINN1_Val << AC_COMPCTRLA_MUXNEG_Pos) /* (AC_COMPCTRLA) Negative pin 1 Position */
#define AC_COMPCTRLA_MUXNEG_AINN2             (AC_COMPCTRLA_MUXNEG_AINN2_Val << AC_COMPCTRLA_MUXNEG_Pos) /* (AC_COMPCTRLA) Negative pin 2 Position */
#define AC_COMPCTRLA_MUXNEG_VREFSCALE         (AC_COMPCTRLA_MUXNEG_VREFSCALE_Val << AC_COMPCTRLA_MUXNEG_Pos) /* (AC_COMPCTRLA) Voltage Reference Scaler Position */
#define AC_COMPCTRLA_MUXPOS_Pos               _UINT32_(12)                                         /* (AC_COMPCTRLA) Positive Input Selection Position */
#define AC_COMPCTRLA_MUXPOS_Msk               (_UINT32_(0x7) << AC_COMPCTRLA_MUXPOS_Pos)           /* (AC_COMPCTRLA) Positive Input Selection Mask */
#define AC_COMPCTRLA_MUXPOS(value)            (AC_COMPCTRLA_MUXPOS_Msk & (_UINT32_(value) << AC_COMPCTRLA_MUXPOS_Pos)) /* Assignment of value for MUXPOS in the AC_COMPCTRLA register */
#define   AC_COMPCTRLA_MUXPOS_AINP0_Val       _UINT32_(0x0)                                        /* (AC_COMPCTRLA) Positive pin 0  */
#define   AC_COMPCTRLA_MUXPOS_AINP1_Val       _UINT32_(0x1)                                        /* (AC_COMPCTRLA) Positive pin 1  */
#define   AC_COMPCTRLA_MUXPOS_AINP2_Val       _UINT32_(0x2)                                        /* (AC_COMPCTRLA) Positive pin 2  */
#define   AC_COMPCTRLA_MUXPOS_AINP3_Val       _UINT32_(0x3)                                        /* (AC_COMPCTRLA) Positive pin 3  */
#define   AC_COMPCTRLA_MUXPOS_AINP5_Val       _UINT32_(0x5)                                        /* (AC_COMPCTRLA) Positive pin 5  */
#define   AC_COMPCTRLA_MUXPOS_AINP6_Val       _UINT32_(0x6)                                        /* (AC_COMPCTRLA) Positive pin 6  */
#define   AC_COMPCTRLA_MUXPOS_VDDIO2DIV10_Val _UINT32_(0x7)                                        /* (AC_COMPCTRLA) VDDIO2 Div10  */
#define AC_COMPCTRLA_MUXPOS_AINP0             (AC_COMPCTRLA_MUXPOS_AINP0_Val << AC_COMPCTRLA_MUXPOS_Pos) /* (AC_COMPCTRLA) Positive pin 0 Position */
#define AC_COMPCTRLA_MUXPOS_AINP1             (AC_COMPCTRLA_MUXPOS_AINP1_Val << AC_COMPCTRLA_MUXPOS_Pos) /* (AC_COMPCTRLA) Positive pin 1 Position */
#define AC_COMPCTRLA_MUXPOS_AINP2             (AC_COMPCTRLA_MUXPOS_AINP2_Val << AC_COMPCTRLA_MUXPOS_Pos) /* (AC_COMPCTRLA) Positive pin 2 Position */
#define AC_COMPCTRLA_MUXPOS_AINP3             (AC_COMPCTRLA_MUXPOS_AINP3_Val << AC_COMPCTRLA_MUXPOS_Pos) /* (AC_COMPCTRLA) Positive pin 3 Position */
#define AC_COMPCTRLA_MUXPOS_AINP5             (AC_COMPCTRLA_MUXPOS_AINP5_Val << AC_COMPCTRLA_MUXPOS_Pos) /* (AC_COMPCTRLA) Positive pin 5 Position */
#define AC_COMPCTRLA_MUXPOS_AINP6             (AC_COMPCTRLA_MUXPOS_AINP6_Val << AC_COMPCTRLA_MUXPOS_Pos) /* (AC_COMPCTRLA) Positive pin 6 Position */
#define AC_COMPCTRLA_MUXPOS_VDDIO2DIV10       (AC_COMPCTRLA_MUXPOS_VDDIO2DIV10_Val << AC_COMPCTRLA_MUXPOS_Pos) /* (AC_COMPCTRLA) VDDIO2 Div10 Position */
#define AC_COMPCTRLA_Msk                      _UINT32_(0x0000777E)                                 /* (AC_COMPCTRLA) Register Mask  */


