vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/ac.h
/* -------- AC_COMPCTRLB : (AC Offset: 0x04) (R/W 32) Comparator # Comparator Control B -------- */
#define AC_COMPCTRLB_RESETVALUE               _UINT32_(0x00)                                       /*  (AC_COMPCTRLB) Comparator # Comparator Control B  Reset Value */

#define AC_COMPCTRLB_REFSEL_Pos               _UINT32_(0)                                          /* (AC_COMPCTRLB) Reference Selection Position */
#define AC_COMPCTRLB_REFSEL_Msk               (_UINT32_(0x3) << AC_COMPCTRLB_REFSEL_Pos)           /* (AC_COMPCTRLB) Reference Selection Mask */
#define AC_COMPCTRLB_REFSEL(value)            (AC_COMPCTRLB_REFSEL_Msk & (_UINT32_(value) << AC_COMPCTRLB_REFSEL_Pos)) /* Assignment of value for REFSEL in the AC_COMPCTRLB register */
#define   AC_COMPCTRLB_REFSEL_VDD_Val         _UINT32_(0x0)                                        /* (AC_COMPCTRLB) VDD  */
#define   AC_COMPCTRLB_REFSEL_INTVREF_Val     _UINT32_(0x1)                                        /* (AC_COMPCTRLB) Internal reference voltage, as defined by the Internal Reference Selection bit field in the Control B register (CTRLB.INTREF)  */
#define   AC_COMPCTRLB_REFSEL_EXTVREF_Val     _UINT32_(0x2)                                        /* (AC_COMPCTRLB) External reference pin  */
#define AC_COMPCTRLB_REFSEL_VDD               (AC_COMPCTRLB_REFSEL_VDD_Val << AC_COMPCTRLB_REFSEL_Pos) /* (AC_COMPCTRLB) VDD Position */
#define AC_COMPCTRLB_REFSEL_INTVREF           (AC_COMPCTRLB_REFSEL_INTVREF_Val << AC_COMPCTRLB_REFSEL_Pos) /* (AC_COMPCTRLB) Internal reference voltage, as defined by the Internal Reference Selection bit field in the Control B register (CTRLB.INTREF) Position */
#define AC_COMPCTRLB_REFSEL_EXTVREF           (AC_COMPCTRLB_REFSEL_EXTVREF_Val << AC_COMPCTRLB_REFSEL_Pos) /* (AC_COMPCTRLB) External reference pin Position */
#define AC_COMPCTRLB_Msk                      _UINT32_(0x00000003)                                 /* (AC_COMPCTRLB) Register Mask  */


/* -------- AC_COMPSCALER : (AC Offset: 0x08) (R/W 32) Comparator # Comparator Scaler -------- */
#define AC_COMPSCALER_RESETVALUE              _UINT32_(0x00)                                       /*  (AC_COMPSCALER) Comparator # Comparator Scaler  Reset Value */

#define AC_COMPSCALER_VALUE_Pos               _UINT32_(0)                                          /* (AC_COMPSCALER) Scaled Reference Voltage Position */
#define AC_COMPSCALER_VALUE_Msk               (_UINT32_(0xFF) << AC_COMPSCALER_VALUE_Pos)          /* (AC_COMPSCALER) Scaled Reference Voltage Mask */
#define AC_COMPSCALER_VALUE(value)            (AC_COMPSCALER_VALUE_Msk & (_UINT32_(value) << AC_COMPSCALER_VALUE_Pos)) /* Assignment of value for VALUE in the AC_COMPSCALER register */
#define AC_COMPSCALER_Msk                     _UINT32_(0x000000FF)                                 /* (AC_COMPSCALER) Register Mask  */


/* -------- AC_CTRLA : (AC Offset: 0x00) (R/W 32) Control A -------- */
#define AC_CTRLA_RESETVALUE                   _UINT32_(0x00)                                       /*  (AC_CTRLA) Control A  Reset Value */

#define AC_CTRLA_SWRST_Pos                    _UINT32_(0)                                          /* (AC_CTRLA) Software Reset Position */
#define AC_CTRLA_SWRST_Msk                    (_UINT32_(0x1) << AC_CTRLA_SWRST_Pos)                /* (AC_CTRLA) Software Reset Mask */
#define AC_CTRLA_SWRST(value)                 (AC_CTRLA_SWRST_Msk & (_UINT32_(value) << AC_CTRLA_SWRST_Pos)) /* Assignment of value for SWRST in the AC_CTRLA register */
#define AC_CTRLA_ENABLE_Pos                   _UINT32_(1)                                          /* (AC_CTRLA) Global Enable Position */
#define AC_CTRLA_ENABLE_Msk                   (_UINT32_(0x1) << AC_CTRLA_ENABLE_Pos)               /* (AC_CTRLA) Global Enable Mask */
#define AC_CTRLA_ENABLE(value)                (AC_CTRLA_ENABLE_Msk & (_UINT32_(value) << AC_CTRLA_ENABLE_Pos)) /* Assignment of value for ENABLE in the AC_CTRLA register */
#define AC_CTRLA_Msk                          _UINT32_(0x00000003)                                 /* (AC_CTRLA) Register Mask  */


/* -------- AC_CTRLB : (AC Offset: 0x04) (R/W 32) Control B -------- */
#define AC_CTRLB_RESETVALUE                   _UINT32_(0x00)                                       /*  (AC_CTRLB) Control B  Reset Value */

#define AC_CTRLB_INTREF_Pos                   _UINT32_(0)                                          /* (AC_CTRLB) Internal Reference Selection Position */
#define AC_CTRLB_INTREF_Msk                   (_UINT32_(0x3) << AC_CTRLB_INTREF_Pos)               /* (AC_CTRLB) Internal Reference Selection Mask */
#define AC_CTRLB_INTREF(value)                (AC_CTRLB_INTREF_Msk & (_UINT32_(value) << AC_CTRLB_INTREF_Pos)) /* Assignment of value for INTREF in the AC_CTRLB register */
#define   AC_CTRLB_INTREF_1V024_Val           _UINT32_(0x0)                                        /* (AC_CTRLB) Internal 1.024V reference  */
#define   AC_CTRLB_INTREF_2V048_Val           _UINT32_(0x1)                                        /* (AC_CTRLB) Internal 2.048V reference  */
#define   AC_CTRLB_INTREF_4V096_Val           _UINT32_(0x2)                                        /* (AC_CTRLB) Internal 4.096V reference  */
#define   AC_CTRLB_INTREF_2V500_Val           _UINT32_(0x3)                                        /* (AC_CTRLB) Internal 2.500V reference  */
#define AC_CTRLB_INTREF_1V024                 (AC_CTRLB_INTREF_1V024_Val << AC_CTRLB_INTREF_Pos)   /* (AC_CTRLB) Internal 1.024V reference Position */
#define AC_CTRLB_INTREF_2V048                 (AC_CTRLB_INTREF_2V048_Val << AC_CTRLB_INTREF_Pos)   /* (AC_CTRLB) Internal 2.048V reference Position */
#define AC_CTRLB_INTREF_4V096                 (AC_CTRLB_INTREF_4V096_Val << AC_CTRLB_INTREF_Pos)   /* (AC_CTRLB) Internal 4.096V reference Position */
#define AC_CTRLB_INTREF_2V500                 (AC_CTRLB_INTREF_2V500_Val << AC_CTRLB_INTREF_Pos)   /* (AC_CTRLB) Internal 2.500V reference Position */
#define AC_CTRLB_Msk                          _UINT32_(0x00000003)                                 /* (AC_CTRLB) Register Mask  */


/* -------- AC_WINCTRL : (AC Offset: 0x14) (R/W 32) Window Control -------- */
#define AC_WINCTRL_RESETVALUE                 _UINT32_(0x00)                                       /*  (AC_WINCTRL) Window Control  Reset Value */

#define AC_WINCTRL_WEN0_Pos                   _UINT32_(0)                                          /* (AC_WINCTRL) Window 0 Enable Position */
#define AC_WINCTRL_WEN0_Msk                   (_UINT32_(0x1) << AC_WINCTRL_WEN0_Pos)               /* (AC_WINCTRL) Window 0 Enable Mask */
#define AC_WINCTRL_WEN0(value)                (AC_WINCTRL_WEN0_Msk & (_UINT32_(value) << AC_WINCTRL_WEN0_Pos)) /* Assignment of value for WEN0 in the AC_WINCTRL register */
#define AC_WINCTRL_WINTSEL0_Pos               _UINT32_(1)                                          /* (AC_WINCTRL) Window 0 Interrupt Selection Position */
#define AC_WINCTRL_WINTSEL0_Msk               (_UINT32_(0x3) << AC_WINCTRL_WINTSEL0_Pos)           /* (AC_WINCTRL) Window 0 Interrupt Selection Mask */
#define AC_WINCTRL_WINTSEL0(value)            (AC_WINCTRL_WINTSEL0_Msk & (_UINT32_(value) << AC_WINCTRL_WINTSEL0_Pos)) /* Assignment of value for WINTSEL0 in the AC_WINCTRL register */
#define   AC_WINCTRL_WINTSEL0_ABOVE_Val       _UINT32_(0x0)                                        /* (AC_WINCTRL) Interrupt when the signal goes above the window  */
#define   AC_WINCTRL_WINTSEL0_INSIDE_Val      _UINT32_(0x1)                                        /* (AC_WINCTRL) Interrupt when the signal goes inside the window  */
#define   AC_WINCTRL_WINTSEL0_BELOW_Val       _UINT32_(0x2)                                        /* (AC_WINCTRL) Interrupt when the signal goes below the window  */
#define   AC_WINCTRL_WINTSEL0_OUTSIDE_Val     _UINT32_(0x3)                                        /* (AC_WINCTRL) Interrupt when the signal goes outside the window  */
#define AC_WINCTRL_WINTSEL0_ABOVE             (AC_WINCTRL_WINTSEL0_ABOVE_Val << AC_WINCTRL_WINTSEL0_Pos) /* (AC_WINCTRL) Interrupt when the signal goes above the window Position */
#define AC_WINCTRL_WINTSEL0_INSIDE            (AC_WINCTRL_WINTSEL0_INSIDE_Val << AC_WINCTRL_WINTSEL0_Pos) /* (AC_WINCTRL) Interrupt when the signal goes inside the window Position */
#define AC_WINCTRL_WINTSEL0_BELOW             (AC_WINCTRL_WINTSEL0_BELOW_Val << AC_WINCTRL_WINTSEL0_Pos) /* (AC_WINCTRL) Interrupt when the signal goes below the window Position */
#define AC_WINCTRL_WINTSEL0_OUTSIDE           (AC_WINCTRL_WINTSEL0_OUTSIDE_Val << AC_WINCTRL_WINTSEL0_Pos) /* (AC_WINCTRL) Interrupt when the signal goes outside the window Position */
#define AC_WINCTRL_Msk                        _UINT32_(0x00000007)                                 /* (AC_WINCTRL) Register Mask  */

